; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-53)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 - object)
 (:init 
    (arm-empty)
    (clear b2)
    (on b2 b8)
    (on b8 b10)
    (on b10 b4)
    (on b4 b5)
    (on b5 b1)
    (on-table b1)
    (clear b3)
    (on b3 b13)
    (on b13 b14)
    (on b14 b11)
    (on b11 b6)
    (on b6 b15)
    (on b15 b12)
    (on b12 b16)
    (on b16 b7)
    (on b7 b9)
    (on-table b9))
 (:goal (and 
(on-table b13)
(on-table b6)
(on-table b12)
(on b2 b13)
(on b11 b6)
(on b14 b12)
(on b16 b2)
(on b4 b11)
))
)

; plan
1. (unstack b3 b13)
   deleted: (on b3 b13) (clear b3) (arm-empty)
   added: (holding b3) (clear b13)
   goals met: 1 of 8
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 8
3. (unstack b13 b14)
   deleted: (on b13 b14) (clear b13) (arm-empty)
   added: (holding b13) (clear b14)
   goals met: 1 of 8
4. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 8
5. (unstack b2 b8)
   deleted: (on b2 b8) (clear b2) (arm-empty)
   added: (holding b2) (clear b8)
   goals met: 2 of 8
6. (stack b2 b13)
   deleted: (clear b13) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b13)
   goals met: 3 of 8
7. (unstack b14 b11)
   deleted: (on b14 b11) (clear b14) (arm-empty)
   added: (holding b14) (clear b11)
   goals met: 3 of 8
8. (stack b14 b3)
   deleted: (clear b3) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b3)
   goals met: 3 of 8
9. (unstack b11 b6)
   deleted: (on b11 b6) (clear b11) (arm-empty)
   added: (holding b11) (clear b6)
   goals met: 2 of 8
10. (stack b11 b8)
   deleted: (clear b8) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b8)
   goals met: 2 of 8
11. (unstack b6 b15)
   deleted: (on b6 b15) (clear b6) (arm-empty)
   added: (holding b6) (clear b15)
   goals met: 2 of 8
12. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 8
13. (unstack b11 b8)
   deleted: (on b11 b8) (clear b11) (arm-empty)
   added: (holding b11) (clear b8)
   goals met: 3 of 8
14. (stack b11 b6)
   deleted: (clear b6) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b6)
   goals met: 4 of 8
15. (unstack b15 b12)
   deleted: (on b15 b12) (clear b15) (arm-empty)
   added: (holding b15) (clear b12)
   goals met: 4 of 8
16. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 4 of 8
17. (unstack b12 b16)
   deleted: (on b12 b16) (clear b12) (arm-empty)
   added: (holding b12) (clear b16)
   goals met: 4 of 8
18. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 5 of 8
19. (unstack b14 b3)
   deleted: (on b14 b3) (clear b14) (arm-empty)
   added: (holding b14) (clear b3)
   goals met: 5 of 8
20. (stack b14 b12)
   deleted: (clear b12) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b12)
   goals met: 6 of 8
21. (unstack b16 b7)
   deleted: (on b16 b7) (clear b16) (arm-empty)
   added: (holding b16) (clear b7)
   goals met: 6 of 8
22. (stack b16 b2)
   deleted: (clear b2) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b2)
   goals met: 7 of 8
23. (unstack b8 b10)
   deleted: (on b8 b10) (clear b8) (arm-empty)
   added: (holding b8) (clear b10)
   goals met: 7 of 8
24. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 7 of 8
25. (unstack b10 b4)
   deleted: (on b10 b4) (clear b10) (arm-empty)
   added: (holding b10) (clear b4)
   goals met: 7 of 8
26. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 7 of 8
27. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 7 of 8
28. (stack b4 b11)
   deleted: (clear b11) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b11)
   goals met: 8 of 8
